<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"bdc5078a404c0deadb291f70a1321ac3746fee1f73e82bd87a03fe20f874b826","plan_job_ref":"Job Create terraform plan #22 at https://github.com/leonitousconforti/infra/actions/runs/16844432775","plan_out_hash":"704f32232b921cc5d3526197f8312e7c44d9d69633829441b200090fb62cfb23","plan_hash":"e3832731a6e29ddca5283d77cdd1a1f87749dd63149a500f8b7201a308d6dc6f","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan in __ltgk.net__<details open><summary>With variables</summary>

```hcl
do_token           = (sensitive value)
porkbun_api_key    = (sensitive value)
porkbun_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 36 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.cloudinit_config.gateway_cloud_init_config["ams3"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "gateway_cloud_init_config" {
+       base64_encode = false
+       boundary      = (known after apply)
+       gzip          = false
+       id            = (known after apply)
+       rendered      = (known after apply)

+       part {
+           content      = (known after apply)
+           content_type = "text/cloud-config"
+           filename     = "cloud.conf"
        }
    }

  # data.cloudinit_config.gateway_cloud_init_config["sfo3"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "gateway_cloud_init_config" {
+       base64_encode = false
+       boundary      = (known after apply)
+       gzip          = false
+       id            = (known after apply)
+       rendered      = (known after apply)

+       part {
+           content      = (known after apply)
+           content_type = "text/cloud-config"
+           filename     = "cloud.conf"
        }
    }

  # data.cloudinit_config.gateway_cloud_init_config["sgp1"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "gateway_cloud_init_config" {
+       base64_encode = false
+       boundary      = (known after apply)
+       gzip          = false
+       id            = (known after apply)
+       rendered      = (known after apply)

+       part {
+           content      = (known after apply)
+           content_type = "text/cloud-config"
+           filename     = "cloud.conf"
        }
    }

  # digitalocean_domain.ltgk_net will be created
+   resource "digitalocean_domain" "ltgk_net" {
+       id   = (known after apply)
+       name = "ltgk.net"
+       ttl  = (known after apply)
+       urn  = (known after apply)
    }

  # digitalocean_droplet.gateway_droplet["ams3"] will be created
+   resource "digitalocean_droplet" "gateway_droplet" {
+       backups              = false
+       created_at           = (known after apply)
+       disk                 = (known after apply)
+       droplet_agent        = true
+       graceful_shutdown    = false
+       id                   = (known after apply)
+       image                = "ubuntu-24-04-x64"
+       ipv4_address         = (known after apply)
+       ipv4_address_private = (known after apply)
+       ipv6                 = true
+       ipv6_address         = (known after apply)
+       locked               = (known after apply)
+       memory               = (known after apply)
+       monitoring           = true
+       name                 = "gateway.ams3.ltgk.net"
+       price_hourly         = (known after apply)
+       price_monthly        = (known after apply)
+       private_networking   = (known after apply)
+       region               = "ams3"
+       resize_disk          = true
+       size                 = "s-1vcpu-512mb-10gb"
+       ssh_keys             = [
+           "47660013",
        ]
+       status               = (known after apply)
+       tags                 = [
+           "gateway",
        ]
+       urn                  = (known after apply)
+       user_data            = (known after apply)
+       vcpus                = (known after apply)
+       volume_ids           = (known after apply)
+       vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.gateway_droplet["sfo3"] will be created
+   resource "digitalocean_droplet" "gateway_droplet" {
+       backups              = false
+       created_at           = (known after apply)
+       disk                 = (known after apply)
+       droplet_agent        = true
+       graceful_shutdown    = false
+       id                   = (known after apply)
+       image                = "ubuntu-24-04-x64"
+       ipv4_address         = (known after apply)
+       ipv4_address_private = (known after apply)
+       ipv6                 = true
+       ipv6_address         = (known after apply)
+       locked               = (known after apply)
+       memory               = (known after apply)
+       monitoring           = true
+       name                 = "gateway.sfo3.ltgk.net"
+       price_hourly         = (known after apply)
+       price_monthly        = (known after apply)
+       private_networking   = (known after apply)
+       region               = "sfo3"
+       resize_disk          = true
+       size                 = "s-1vcpu-512mb-10gb"
+       ssh_keys             = [
+           "47660013",
        ]
+       status               = (known after apply)
+       tags                 = [
+           "gateway",
        ]
+       urn                  = (known after apply)
+       user_data            = (known after apply)
+       vcpus                = (known after apply)
+       volume_ids           = (known after apply)
+       vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.gateway_droplet["sgp1"] will be created
+   resource "digitalocean_droplet" "gateway_droplet" {
+       backups              = false
+       created_at           = (known after apply)
+       disk                 = (known after apply)
+       droplet_agent        = true
+       graceful_shutdown    = false
+       id                   = (known after apply)
+       image                = "ubuntu-24-04-x64"
+       ipv4_address         = (known after apply)
+       ipv4_address_private = (known after apply)
+       ipv6                 = true
+       ipv6_address         = (known after apply)
+       locked               = (known after apply)
+       memory               = (known after apply)
+       monitoring           = true
+       name                 = "gateway.sgp1.ltgk.net"
+       price_hourly         = (known after apply)
+       price_monthly        = (known after apply)
+       private_networking   = (known after apply)
+       region               = "sgp1"
+       resize_disk          = true
+       size                 = "s-1vcpu-512mb-10gb"
+       ssh_keys             = [
+           "47660013",
        ]
+       status               = (known after apply)
+       tags                 = [
+           "gateway",
        ]
+       urn                  = (known after apply)
+       user_data            = (known after apply)
+       vcpus                = (known after apply)
+       volume_ids           = (known after apply)
+       vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.idm_droplet["ams3"] will be created
+   resource "digitalocean_droplet" "idm_droplet" {
+       backups              = false
+       created_at           = (known after apply)
+       disk                 = (known after apply)
+       droplet_agent        = true
+       graceful_shutdown    = false
+       id                   = (known after apply)
+       image                = "fedora-41-x64"
+       ipv4_address         = (known after apply)
+       ipv4_address_private = (known after apply)
+       ipv6                 = true
+       ipv6_address         = (known after apply)
+       locked               = (known after apply)
+       memory               = (known after apply)
+       monitoring           = true
+       name                 = "idm01-primary.ams3.internal.ltgk.net"
+       price_hourly         = (known after apply)
+       price_monthly        = (known after apply)
+       private_networking   = (known after apply)
+       region               = "ams3"
+       resize_disk          = true
+       size                 = "s-1vcpu-2gb"
+       ssh_keys             = [
+           "47660013",
        ]
+       status               = (known after apply)
+       tags                 = [
+           "dns",
+           "freeipa",
+           "idm",
        ]
+       urn                  = (known after apply)
+       user_data            = "5485430c883f40bdcef5abd33fde7f55fad51222"
+       vcpus                = (known after apply)
+       volume_ids           = (known after apply)
+       vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.idm_droplet["sfo3"] will be created
+   resource "digitalocean_droplet" "idm_droplet" {
+       backups              = false
+       created_at           = (known after apply)
+       disk                 = (known after apply)
+       droplet_agent        = true
+       graceful_shutdown    = false
+       id                   = (known after apply)
+       image                = "fedora-41-x64"
+       ipv4_address         = (known after apply)
+       ipv4_address_private = (known after apply)
+       ipv6                 = true
+       ipv6_address         = (known after apply)
+       locked               = (known after apply)
+       memory               = (known after apply)
+       monitoring           = true
+       name                 = "idm01-primary.sfo3.internal.ltgk.net"
+       price_hourly         = (known after apply)
+       price_monthly        = (known after apply)
+       private_networking   = (known after apply)
+       region               = "sfo3"
+       resize_disk          = true
+       size                 = "s-1vcpu-2gb"
+       ssh_keys             = [
+           "47660013",
        ]
+       status               = (known after apply)
+       tags                 = [
+           "dns",
+           "freeipa",
+           "idm",
        ]
+       urn                  = (known after apply)
+       user_data            = "149b7390c4f3a0c31971c6ebf8e7e7e6ca50b5dd"
+       vcpus                = (known after apply)
+       volume_ids           = (known after apply)
+       vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.idm_droplet["sgp1"] will be created
+   resource "digitalocean_droplet" "idm_droplet" {
+       backups              = false
+       created_at           = (known after apply)
+       disk                 = (known after apply)
+       droplet_agent        = true
+       graceful_shutdown    = false
+       id                   = (known after apply)
+       image                = "fedora-41-x64"
+       ipv4_address         = (known after apply)
+       ipv4_address_private = (known after apply)
+       ipv6                 = true
+       ipv6_address         = (known after apply)
+       locked               = (known after apply)
+       memory               = (known after apply)
+       monitoring           = true
+       name                 = "idm01-primary.sgp1.internal.ltgk.net"
+       price_hourly         = (known after apply)
+       price_monthly        = (known after apply)
+       private_networking   = (known after apply)
+       region               = "sgp1"
+       resize_disk          = true
+       size                 = "s-1vcpu-2gb"
+       ssh_keys             = [
+           "47660013",
        ]
+       status               = (known after apply)
+       tags                 = [
+           "dns",
+           "freeipa",
+           "idm",
        ]
+       urn                  = (known after apply)
+       user_data            = "51ef96e1814e41b39e95106fdd112084fb1dba65"
+       vcpus                = (known after apply)
+       volume_ids           = (known after apply)
+       vpc_uuid             = (known after apply)
    }

  # digitalocean_project_resources.gateway_project_assignment["ams3"] will be created
+   resource "digitalocean_project_resources" "gateway_project_assignment" {
+       id        = (known after apply)
+       project   = "acf5abcc-4976-4233-9832-7c7ca3efea5a"
+       resources = (known after apply)
    }

  # digitalocean_project_resources.gateway_project_assignment["sfo3"] will be created
+   resource "digitalocean_project_resources" "gateway_project_assignment" {
+       id        = (known after apply)
+       project   = "acf5abcc-4976-4233-9832-7c7ca3efea5a"
+       resources = (known after apply)
    }

  # digitalocean_project_resources.gateway_project_assignment["sgp1"] will be created
+   resource "digitalocean_project_resources" "gateway_project_assignment" {
+       id        = (known after apply)
+       project   = "acf5abcc-4976-4233-9832-7c7ca3efea5a"
+       resources = (known after apply)
    }

  # digitalocean_project_resources.idm_project_assignment["ams3"] will be created
+   resource "digitalocean_project_resources" "idm_project_assignment" {
+       id        = (known after apply)
+       project   = "acf5abcc-4976-4233-9832-7c7ca3efea5a"
+       resources = (known after apply)
    }

  # digitalocean_project_resources.idm_project_assignment["sfo3"] will be created
+   resource "digitalocean_project_resources" "idm_project_assignment" {
+       id        = (known after apply)
+       project   = "acf5abcc-4976-4233-9832-7c7ca3efea5a"
+       resources = (known after apply)
    }

  # digitalocean_project_resources.idm_project_assignment["sgp1"] will be created
+   resource "digitalocean_project_resources" "idm_project_assignment" {
+       id        = (known after apply)
+       project   = "acf5abcc-4976-4233-9832-7c7ca3efea5a"
+       resources = (known after apply)
    }

  # digitalocean_project_resources.ltgk_net_domain_project_assignment will be created
+   resource "digitalocean_project_resources" "ltgk_net_domain_project_assignment" {
+       id        = (known after apply)
+       project   = "acf5abcc-4976-4233-9832-7c7ca3efea5a"
+       resources = (known after apply)
    }

  # digitalocean_record.dmarc will be created
+   resource "digitalocean_record" "dmarc" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "_dmarc"
+       ttl    = 300
+       type   = "TXT"
+       value  = "v=DMARC1; p=quarantine; rua=mailto:25f8c5e6@mxtoolbox.dmarc-report.com; ruf=mailto:25f8c5e6@forensics.dmarc-report.com; fo=1"
    }

  # digitalocean_record.domainkey will be created
+   resource "digitalocean_record" "domainkey" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "default._domainkey"
+       ttl    = 300
+       type   = "TXT"
+       value  = "v=DKIM1; k=rsa; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQC8158yxaFjZYq/gcbZ9pfsLcq7pkABLfl8q1AXWbAMpgZSUdpw1o/CKSHmVpnYL9pwLTYvLxpN9W8DkO5lSRFWxP/ljKCX/rJzSJ28MwI7UuPjbWpG43/zdIJc9yUP8F9ulmumnVinMEvQPVW49u1RPSDeCovTMWCrLXeRrRE86wIDAQAB"
    }

  # digitalocean_record.gateway_AAAA_record["ams3"] will be created
+   resource "digitalocean_record" "gateway_AAAA_record" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "gateway.ams3"
+       ttl    = 3600
+       type   = "AAAA"
+       value  = (known after apply)
    }

  # digitalocean_record.gateway_AAAA_record["sfo3"] will be created
+   resource "digitalocean_record" "gateway_AAAA_record" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "gateway.sfo3"
+       ttl    = 3600
+       type   = "AAAA"
+       value  = (known after apply)
    }

  # digitalocean_record.gateway_AAAA_record["sgp1"] will be created
+   resource "digitalocean_record" "gateway_AAAA_record" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "gateway.sgp1"
+       ttl    = 3600
+       type   = "AAAA"
+       value  = (known after apply)
    }

  # digitalocean_record.gateway_A_record["ams3"] will be created
+   resource "digitalocean_record" "gateway_A_record" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "gateway.ams3"
+       ttl    = 3600
+       type   = "A"
+       value  = (known after apply)
    }

  # digitalocean_record.gateway_A_record["sfo3"] will be created
+   resource "digitalocean_record" "gateway_A_record" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "gateway.sfo3"
+       ttl    = 3600
+       type   = "A"
+       value  = (known after apply)
    }

  # digitalocean_record.gateway_A_record["sgp1"] will be created
+   resource "digitalocean_record" "gateway_A_record" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "gateway.sgp1"
+       ttl    = 3600
+       type   = "A"
+       value  = (known after apply)
    }

  # digitalocean_record.mx1 will be created
+   resource "digitalocean_record" "mx1" {
+       domain   = "ltgk.net"
+       fqdn     = (known after apply)
+       id       = (known after apply)
+       name     = "@"
+       priority = 10
+       ttl      = 600
+       type     = "MX"
+       value    = "fwd1.porkbun.com."
    }

  # digitalocean_record.mx2 will be created
+   resource "digitalocean_record" "mx2" {
+       domain   = "ltgk.net"
+       fqdn     = (known after apply)
+       id       = (known after apply)
+       name     = "@"
+       priority = 20
+       ttl      = 600
+       type     = "MX"
+       value    = "fwd2.porkbun.com."
    }

  # digitalocean_record.sfp will be created
+   resource "digitalocean_record" "sfp" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "@"
+       ttl    = 300
+       type   = "TXT"
+       value  = "v=spf1 include:_spf.porkbun.com ~all"
    }

  # digitalocean_reserved_ip.gateway_reserved_ip["ams3"] will be created
+   resource "digitalocean_reserved_ip" "gateway_reserved_ip" {
+       droplet_id = (known after apply)
+       id         = (known after apply)
+       ip_address = (known after apply)
+       region     = "ams3"
+       urn        = (known after apply)
    }

  # digitalocean_reserved_ip.gateway_reserved_ip["sfo3"] will be created
+   resource "digitalocean_reserved_ip" "gateway_reserved_ip" {
+       droplet_id = (known after apply)
+       id         = (known after apply)
+       ip_address = (known after apply)
+       region     = "sfo3"
+       urn        = (known after apply)
    }

  # digitalocean_reserved_ip.gateway_reserved_ip["sgp1"] will be created
+   resource "digitalocean_reserved_ip" "gateway_reserved_ip" {
+       droplet_id = (known after apply)
+       id         = (known after apply)
+       ip_address = (known after apply)
+       region     = "sgp1"
+       urn        = (known after apply)
    }

  # digitalocean_vpc.vpc_ltgk_internal["ams3"] will be created
+   resource "digitalocean_vpc" "vpc_ltgk_internal" {
+       created_at = (known after apply)
+       default    = (known after apply)
+       id         = (known after apply)
+       ip_range   = (known after apply)
+       name       = "ltgk-internal-ams3"
+       region     = "ams3"
+       urn        = (known after apply)
    }

  # digitalocean_vpc.vpc_ltgk_internal["sfo3"] will be created
+   resource "digitalocean_vpc" "vpc_ltgk_internal" {
+       created_at = (known after apply)
+       default    = (known after apply)
+       id         = (known after apply)
+       ip_range   = (known after apply)
+       name       = "ltgk-internal-sfo3"
+       region     = "sfo3"
+       urn        = (known after apply)
    }

  # digitalocean_vpc.vpc_ltgk_internal["sgp1"] will be created
+   resource "digitalocean_vpc" "vpc_ltgk_internal" {
+       created_at = (known after apply)
+       default    = (known after apply)
+       id         = (known after apply)
+       ip_range   = (known after apply)
+       name       = "ltgk-internal-sgp1"
+       region     = "sgp1"
+       urn        = (known after apply)
    }

  # digitalocean_vpc_peering.vpc_peering_ltgk_internal["ams3-sfo3"] will be created
+   resource "digitalocean_vpc_peering" "vpc_peering_ltgk_internal" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       name       = "ltgk-internal-ams3-and-sfo3"
+       status     = (known after apply)
+       vpc_ids    = (known after apply)
    }

  # digitalocean_vpc_peering.vpc_peering_ltgk_internal["ams3-sgp1"] will be created
+   resource "digitalocean_vpc_peering" "vpc_peering_ltgk_internal" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       name       = "ltgk-internal-ams3-and-sgp1"
+       status     = (known after apply)
+       vpc_ids    = (known after apply)
    }

  # digitalocean_vpc_peering.vpc_peering_ltgk_internal["sfo3-sgp1"] will be created
+   resource "digitalocean_vpc_peering" "vpc_peering_ltgk_internal" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       name       = "ltgk-internal-sfo3-and-sgp1"
+       status     = (known after apply)
+       vpc_ids    = (known after apply)
    }

  # porkbun_domain_nameservers.porkbun-nameservers will be created
+   resource "porkbun_domain_nameservers" "porkbun-nameservers" {
+       domain      = "ltgk.net"
+       nameservers = [
+           "ns1.digitalocean.com",
+           "ns2.digitalocean.com",
+           "ns3.digitalocean.com",
        ]
    }

  # time_sleep.wait_to_destroy_vpcs will be created
+   resource "time_sleep" "wait_to_destroy_vpcs" {
+       destroy_duration = "30s"
+       id               = (known after apply)
    }

Plan: 36 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #22](https://github.com/leonitousconforti/infra/actions/runs/16844432775)